app/controllers/api/v1/users_controller.rb

  def show
    respond_with User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "5"]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("auth_token", "created_at", "email", "encrypted_password", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"